/* No comment provided by engineer. */
"Set Cyberduck as default application for FTP and SFTP locations?" = "A Cyberduck beállítása alapértelmezett alkalmazásnak az FTP és SFTP helyekhez?";

/* No comment provided by engineer. */
"As the default application, Cyberduck will open when you click on FTP or SFTP links in other applications, such as your web browser. You can change this setting in the Preferences later." = "Mint alapértelmezett alkalmazás, a Cyberduck fog megnyílni amikor ön FTP vagy SFTP linkekre kattint más alkalmazásokban, mint például web böngésző. Megváltoztathatja ezt később a beállításokban.";

/* Apply proposed action. */
"Change" = "Váltás";

/* Do not display this dialog again. */
"Don't ask again" = "Ne kérdezze újra";

/* Don't change anything. */
"Cancel" = "Mégsem";

/* Bookmark import from thirdparty applications */ 
"Import" = "Importál";
/* Import <<Application Name>> Bookmarks */
"Import {0} Bookmarks" = "{0} Könyvjelző importálása";
/* 23 bookmarks found. */
"{0} bookmarks found. Do you want to add these to your bookmarks?" = "{0} könyvjelző megtalálva? Szeretné hozzáadni őket a könyvjelzőihez?";
/* Write the source application into the comment field of the imported bookmark */
"Imported from {0}" = "Importálva innen {0}";